app/Controllers/Admin.php

    public function dashboard()
    {
        // Check if user is logged in and is admin
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            session()->setFlashdata('error', 'Access denied. Admins only.');
            return redirect()->to(base_url('login'));
        }

        $userModel = new UserModel();
        $courseModel = new CourseModel();
        $enrollmentModel = new EnrollmentModel();

        $data = [
            'title' => 'Admin Dashboard',
            'users' => $userModel->findAll(),
            'courses' => $courseModel->findAll(),
            'enrollments' => $enrollmentModel->countAll(),
            'totalUsers' => $userModel->countAll(),
            'totalCourses' => $courseModel->countAll()
---
SELECT *
FROM `users`
SELECT *
FROM `courses`
SELECT COUNT(*) AS `numrows` FROM `enrollments`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `courses`

    public function courses()
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            session()->setFlashdata('error', 'Access denied. Admins only.');
            return redirect()->to(base_url('login'));
        }

        $courseModel = new CourseModel();
        $userModel = new UserModel();

        // Get all courses with instructor names
        $courses = $courseModel->select('courses.*, users.name as instructor_name')
                              ->join('users', 'users.id = courses.instructor_id', 'left')
                              ->orderBy('courses.created_at', 'DESC')
                              ->findAll();

        // Get all teachers for the create form
        $teachers = $userModel->where('role', 'teacher')->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
ORDER BY `courses`.`created_at` DESC
SELECT *
FROM `users`
WHERE `role` = 'teacher'

    public function deleteCourse($id)
    {
        if (!session()->get('isLoggedIn') || session()->get('role') !== 'admin') {
            session()->setFlashdata('error', 'Access denied. Admins only.');
            return redirect()->to(base_url('login'));
        }

        $courseModel = new CourseModel();

        $course = $courseModel->find($id);
        if (!$course) {
            session()->setFlashdata('error', 'Course not found.');
            return redirect()->to(base_url('admin/courses'));
        }

        // Delete course
        if ($courseModel->delete($id)) {
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '6'
DELETE FROM `courses`
WHERE `id` IN ('6')