app/Controllers/Announcement.php

SELECT *
FROM `announcements`
---
    public function index()
    {
        $model = new AnnouncementModel();
        $data['announcements'] = $model->findAll();

INSERT INTO `announcements` (`title`, `content`, `created_at`) VALUES ('summer', 'asdasdsadasdsadasdasdasdsadsadasdasdsadasdasdsadasdasdasd', '2025-10-18 09:34:51')
---
    public function add()
    {
        helper(['form']);
        $model = new AnnouncementModel();

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'title' => 'required|min_length[3]|max_length[255]',
                'content' => 'required|min_length[10]'
            ];

            if ($this->validate($rules)) {
                $data = [
                    'title' => $this->request->getPost('title'),
                    'content' => $this->request->getPost('content'),
                    'date_posted' => date('Y-m-d H:i:s'),
                    'posted_by' => session()->get('user_id')
                ];

                if ($model->insert($data)) {