app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        // Redirect if already logged in
        if (session()->get('isLoggedIn')) {
            // Redirect to role-specific dashboard
            $role = session()->get('role');
            switch ($role) {
                case 'admin':
                    return redirect()->to(base_url('admin/dashboard'));
                case 'teacher':
                    return redirect()->to(base_url('teacher/dashboard'));
                case 'student':
                    return redirect()->to(base_url('student/dashboard'));
                default:
                    return redirect()->to(base_url('dashboard'));
            }
        }

        helper(['form']);
        $session = session();
        $model = new UserModel();
        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required'
            ];
            if ($this->validate($rules)) {
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');
                $user = $model->where('email', $email)->first();