app/Controllers/Course.php

        }

        // Validate course exists
        $course = $this->courseModel->find($course_id);
---
SELECT *
FROM `courses`
WHERE `courses`.`id` = '9'

    public function search()
    {
        // Get search term from GET or POST
        $searchTerm = $this->request->getGet('search_term') ?? $this->request->getPost('search_term');

        // Build query
        $query = $this->courseModel->select('courses.*, users.name as instructor_name')
            ->join('users', 'users.id = courses.instructor_id')
            ->where('courses.status', 'published');

        // Apply search if term is provided
        if (!empty($searchTerm)) {
            $query->groupStart()
                ->like('courses.title', $searchTerm)
                ->orLike('courses.description', $searchTerm)
                ->orLike('courses.category', $searchTerm)
                ->orLike('users.name', $searchTerm)
                ->groupEnd();
        }

        // Get results
        $courses = $query->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `courses`.`status` = 'published'
AND   (
`courses`.`title` LIKE '%48106-NET102%' ESCAPE '!'
OR  `courses`.`description` LIKE '%48106-NET102%' ESCAPE '!'
OR  `courses`.`category` LIKE '%48106-NET102%' ESCAPE '!'
OR  `users`.`name` LIKE '%48106-NET102%' ESCAPE '!'
 )