app/Controllers/Materials.php

SELECT *
FROM `courses`
WHERE `courses`.`id` = '2'
---
    public function upload($course_id)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            session()->setFlashdata('error', 'You must be logged in to upload materials.');
            return redirect()->to(base_url('login'));
        }

        $userRole = session()->get('role');
        $userId = session()->get('user_id');

        // Check permissions: Admin can upload to any course, Instructor only to their courses
        $course = $this->courseModel->find($course_id);