app/Controllers/Notifications.php

SELECT *
FROM `notifications`
WHERE `notifications`.`id` = '5'
---
    public function mark_as_read($id)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'You must be logged in to mark notifications as read.'
            ]);
        }

        $userId = session()->get('user_id');

        // Verify notification belongs to user
        $notification = $this->notificationModel->find($id);