app/Controllers/Student.php

    public function dashboard()
    {
        // Must be logged in
        if (!session()->get('isLoggedIn')) {
            session()->setFlashdata('error', 'Please login first.');
            return redirect()->to(base_url('login'));
        }

        // Must be Student
        if (session('role') !== 'student') {
            session()->setFlashdata('error', 'Unauthorized access.');
            return redirect()->to(base_url('login'));
        }

        $user_id = session()->get('user_id');

        // Get user's enrollments
        $enrollments = $this->enrollmentModel->getUserEnrollments($user_id);

        // Get available courses (courses not enrolled in) with instructor information
        $enrolled_course_ids = array_column($enrollments, 'course_id');
        $available_courses = [];

        if (!empty($enrolled_course_ids)) {
            $available_courses = $this->courseModel->select('courses.*, users.name as instructor_name')
                ->join('users', 'users.id = courses.instructor_id')
                ->where('courses.status', 'published')
                ->whereNotIn('courses.id', $enrolled_course_ids)
                ->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `courses`.`status` = 'published'
AND `courses`.`id` NOT IN ('9','3','2')