app/Models/CourseModel.php

    public function getCoursesWithInstructor()
    {
        return $this->select('courses.*, users.name as instructor_name')
                    ->join('users', 'users.id = courses.instructor_id')
                    ->where('courses.status', 'published')
                    ->findAll();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `courses`.`status` = 'published'

    public function getCourseWithInstructor($id)
    {
        return $this->select('courses.*, users.name as instructor_name')
                    ->join('users', 'users.id = courses.instructor_id')
                    ->where('courses.id', $id)
                    ->first();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`instructor_id`
WHERE `courses`.`id` = '3'
 LIMIT 1

    public function getCoursesByInstructor($instructor_id)
    {
        return $this->where('instructor_id', $instructor_id)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `courses`
WHERE `instructor_id` = '2'
ORDER BY `created_at` DESC