app/Models/EnrollmentModel.php

INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`, `status`, `progress`, `created_at`, `updated_at`) VALUES ('4', '9', '2025-12-02 15:57:52', 'active', 0, '2025-12-02 15:57:52', '2025-12-02 15:57:52')
---
    public function enrollUser($data)
    {
        // Set default values
        $data['enrollment_date'] = $data['enrollment_date'] ?? date('Y-m-d H:i:s');
        $data['status'] = $data['status'] ?? 'active';
        $data['progress'] = $data['progress'] ?? 0.00;

        // Check if user is already enrolled
        if ($this->isAlreadyEnrolled($data['user_id'], $data['course_id'])) {
            return false; // User already enrolled
        }

        return $this->insert($data);

SELECT `enrollments`.*, `courses`.`title` as `course_title`, `courses`.`description` as `course_description`, `courses`.`instructor_id`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '4'
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getUserEnrollments($user_id)
    {
        return $this->select('enrollments.*, courses.title as course_title, courses.description as course_description, courses.instructor_id')
                    ->join('courses', 'courses.id = enrollments.course_id')
                    ->where('enrollments.user_id', $user_id)
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();

SELECT *
FROM `enrollments`
WHERE `user_id` = '4'
AND `course_id` = '9'
 LIMIT 1
---
    public function isAlreadyEnrolled($user_id, $course_id)
    {
        $enrollment = $this->where('user_id', $user_id)
                          ->where('course_id', $course_id)
                          ->first();

SELECT `enrollments`.*, `users`.`name` as `student_name`, `users`.`email` as `student_email`
FROM `enrollments`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `enrollments`.`course_id` = '9'
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getCourseEnrollments($course_id)
    {
        return $this->select('enrollments.*, users.name as student_name, users.email as student_email')
                    ->join('users', 'users.id = enrollments.user_id')
                    ->where('enrollments.course_id', $course_id)
                    ->orderBy('enrollments.enrollment_date', 'DESC')
                    ->findAll();