app/Models/MaterialModel.php

INSERT INTO `materials` (`course_id`, `file_name`, `file_path`, `file_size`, `file_type`, `uploaded_by`, `created_at`, `updated_at`) VALUES ('2', 'BOLANDO John Lawrence - HOMEWORK 2.docx', 'materials/1764681009_e2f6defb54f3ca7b0667.docx', 4030710, 'application/vnd.openxmlformats-officedocument.wordprocessingml.document', '1', '2025-12-02 13:10:09', '2025-12-02 13:10:09')
---
    public function insertMaterial($data)
    {
        return $this->insert($data);

SELECT `materials`.*, `users`.`name` as `uploaded_by_name`
FROM `materials`
LEFT JOIN `users` ON `users`.`id` = `materials`.`uploaded_by`
WHERE `materials`.`course_id` = '3'
ORDER BY `materials`.`created_at` DESC
---
    public function getMaterialsByCourse($course_id)
    {
        return $this->select('materials.*, users.name as uploaded_by_name')
                    ->join('users', 'users.id = materials.uploaded_by', 'left')
                    ->where('materials.course_id', $course_id)
                    ->orderBy('materials.created_at', 'DESC')
                    ->findAll();