app/Models/NotificationModel.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '4'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();

SELECT *
FROM `notifications`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getNotificationsForUser($userId, $limit = 5)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN ('5')
---
    public function markAsRead($notificationId)
    {
        return $this->update($notificationId, ['is_read' => 1]);

INSERT INTO `notifications` (`user_id`, `message`, `is_read`, `created_at`) VALUES ('4', 'You have been enrolled in 48105-PD312', 0, '2025-12-02 15:57:52')
---
    public function createNotification($data)
    {
        // Set default values
        $data['is_read'] = $data['is_read'] ?? 0;
        $data['created_at'] = $data['created_at'] ?? date('Y-m-d H:i:s');

        return $this->insert($data);